// Variables 
let btn = document.querySelector('#new-quote');
let quote = document.querySelector('.qoute');
let person = document.querySelector('.person');

const quotes = [{quote:`"Бог дав вам тіло, яке може витримати майже все. Ваше завдання – переконати в цьому свій розум."`,
person:`Вінсент Ломбарді`,},
{quote:`"Неважливо, як повільно ти просувається. Головне – ти не зупиняєшся."`,
person:`Брюс Лі`},
{quote:`"Більшість людей ніколи не біжить досить довго на своєму першому диханні, щоб дізнатися, що у них є друге."`,
person:`Вільям Джеймс`},
{quote:`"Якщо ти хочеш бути кращим за інших, то приготуйся робити те, що інші не хочуть робити."`,
person:`Майкл Фелпс`},
{quote:`"Я промахнувся 9 000 разів за свою кар’єру. Я програв майже 300 ігор. 26 раз мені було довірено вирішальний кидок, і я промахувався. Я зазнавав поразок знову і знову. І саме тому я досяг успіху."`,
person:`Майкл Джордан`},
{quote:`"Рятівною силою в нашому світі є спорт – над ним як  раніше майорить прапор оптимізму, тут дотримуються правил і поважають супротивника незалежно від того, на чиєму боці перемога."`,
person:`Д. Голсуорсі`},
{quote:`"Фізичні вправи можуть замінити безліч ліків, але жодні ліки в світі не можуть замінити фізичні вправи."`,
person:`Анджело Моссо`},
{quote:`"Сміливість не означає, що ви не боїтеся. Сміливість означає, що ви не дозволяєте страху зупинити вас."`,
person:`Бетані Гамільтон`},
{quote:`"Якщо у вас все під контролем, значить ви рухаєтеся недостатньо швидко."`,
person:`Маріо Андретти`},
{quote:`"У житті мало що можна зробити, якщо ти працюєш тільки в ті дні, коли тобі добре."`,
person:`Джеррі Уест`},];

btn.addEventListener('click', function(){
    let random = Math.floor(Math.random() * quotes.length);
    quote.innerHTML = quotes[random].quote;
    person.innerHTML = quotes[random].person;
    
});